In [52]:
!pip install psycopg2-binary

Requirement already satisfied: psycopg2-binary in /opt/anaconda3/envs/PythonData/lib/python3.6/site-packages (2.9.2)

In [53]:
# Import dependencies
from sqlalchemy import create_engine
import pandas as pd 
import matplotlib.pyplot as plt
import psycopg2
import numpy as np

In [54]:
# Create engine to talk to database
engine = create_engine('postgresql://postgres:postgres@localhost:5432/employee_queries')
conn = engine.connect()

In [55]:
# Query the salary record in the database
salary_data = pd.read_sql("SELECT * FROM salaries", conn)

In [5]:
# Preview the data
salary_data.head()

   emp_no  salary
0   10001   60117
1   10002   65828
2   10003   40006
3   10004   40054
4   10005   78228

In [56]:
# Plot Histogram
# plt.figure(figsize=(0,5))
# # Set axis and tick location
# x_axis = salary_data["emp_no"]
# ticks_location = np.arange(len(salary_data))
# y_axis = salary_data["salary"]

# # Create bar chart
# plt.bar(x_axis, y_axis, align="center", alpha=0, color='r')

# plt.xticks(ticks_location, x_axis, rotation="vertical")

# plt.show()

In [57]:
# Query the title and employee record in the database
title_data = pd.read_sql("SELECT * FROM titles", conn)
employee_data = pd.read_sql("SELECT * FROM employees", conn)

In [58]:
# Display title data
title_data.head()

  title_id               title
0    s0001               Staff
1    s0002        Senior Staff
2    e0001  Assistant Engineer
3    e0002            Engineer
4    e0003     Senior Engineer

In [59]:
# Rename column to merge 
employee_df = employee_data.rename({'emp_title_id':'title_id'}, axis='columns')

employee_df.head()

   emp_no title_id  birth_date  first_name  last_name sex   hire_date
0  473302    s0001  1953-07-25    Hideyuki   Zallocco   M  1990-04-28
1  475053    e0002  1954-11-18       Byong  Delgrande   F  1991-09-07
2   57444    e0002  1958-01-30       Berry       Babb   F  1992-03-21
3  421786    s0001  1957-09-28       Xiong   Verhoeff   M  1987-11-26
4  282238    e0003  1952-10-28  Abdelkader    Baumann   F  1991-01-18

In [60]:
# Merge employees and title 
merge_1 = pd.merge(title_data, employee_df, on='title_id')

In [104]:
# Final and clean merge

final_merge = pd.merge(merge_1, salary_data, on='emp_no')

Clean_df = final_merge.drop(columns=['title_id', 'emp_no', 'first_name', 'last_name', 'sex', 'hire_date', 'birth_date'])

Clean_df.head()

   title  salary
0  Staff   40000
1  Staff   40000
2  Staff   56087
3  Staff   87084
4  Staff   63016

In [91]:
# Group df

salary_by_title_df = Clean_df.groupby(['title']).mean()

salary_by_title_df['salary'] = salary_by_title_df['salary'].map('${:,.2f}'.format)

salary_by_title_df.reset_index()

                title      salary
0  Assistant Engineer  $48,564.43
1            Engineer  $48,535.34
2             Manager  $51,531.04
3     Senior Engineer  $48,506.80
4        Senior Staff  $58,550.17
5               Staff  $58,465.38
6    Technique Leader  $48,582.90

In [107]:
# Bar Chart

title = ['Assitant Engineer', 'Engineer', 'Manager', 'Senior Engineer', 'Senior Staff', 'Staff', 'Technique Leader']

x_axis = np.arange(len(title))
y_axis = salary_by_title_df['salary']

plt.bar(x_axis, y_axis, color='r', alpha=0, align="center")